package postgres

import (
	"flag"
	"log"
	"strings"

	"github.com/spf13/viper"
	"golang.org/x/crypto/bcrypt"
)

const insertFirstUser = `
INSERT INTO users (
	user_id,
	name,
	batch,
	email,
	password,
	created_by,
	updated_by
) VALUES (
	'a67dc254-7410-4394-8b53-eb148eab0477',
	$1,
	$2,
	$3,
	$4,
	'a67dc254-7410-4394-8b53-eb148eab0477',
	'a67dc254-7410-4394-8b53-eb148eab0477'
) RETURNING
	user_id;
`

const insertFirstCurrency = `
INSERT INTO currency (
	name,
	exchange_rate,
	created_by,
	updated_by
) VALUES (
	'BDT',
	1,
	'a67dc254-7410-4394-8b53-eb148eab0477',
	'a67dc254-7410-4394-8b53-eb148eab0477'
) RETURNING
	id;
`

const insertSettings = `
INSERT INTO settings (
	patient_name,
	title,
	banner_title,
	highlighted_banner_title,
	banner_description,
	highlighted_banner_description,
	banner_image,
	about_patient,
	target_amount,
	show_med_docs,
	show_collection,
	show_daily_report,
	show_fund_updates,
	calculate_collection,
	total_amount,
	updated_by
) VALUES (
	'Tamal',
	'Save Tamal',
	'তমাল বাঁচতে চায়',
	'তমাল',
	'খুলনা বিশ্ববিদ্যালয়ের ইলেক্ট্রনিক্স অ্যান্ড কমিউনিকেশন ইঞ্জিনিয়ারিং ডিসিপ্লিনের ‘১১ ব্যাচের ছাত্র মো. নাজমুল ইসলাম তমাল- দুরারোগ্য ব্লাড ক্যান্সারে আক্রান্ত! তমালের চিকিৎসার জন্য প্রায় ৭৫ লাখ টাকা প্রয়োজন যা এই মুহুর্তে তার পরিবারের পক্ষে বহন করা অসম্ভব। তাই তমালকে বাঁচাতে আপনাদের আর্থিক সহায়তা অত্যন্ত জরুরী।',
	'প্রায় ৭৫ লাখ',
	'TamalBhai.jpeg',
	'<p>তমাল বাঁচতে চায়।</p>

	<p>মোঃ নাজমুল ইসলাম তমাল, ৩৩ বছরের একজন যুবক, সদ্য বিবাহিত, স্কুল-কলেজ এবং বিশ্ববিদ্যালয়ের পড়াশোনা শেষ করেছেন যতাক্রমে মাগুরা সরকারি উচ্চবিদ্যালয় এবং খুলনা বিশ্ববিদ্যালয় থেকে। অতঃপর যোগদান ব্র্যাক ব্যাংকের আইটি তে এবং সেখান থেকে পরবর্তিতে টেলিকম প্রতিষ্ঠান রবিতে। ২০২১ সালে বিবাহ করেছেন তার একই স্কুল এবং কালক্রমে একই বিশ্ববিদ্যালয়ের জুনিয়র শিক্ষার্থীকে। জীবন তো তখন কেবল শুরু তমালের। অন্তত তমাল আর তার স্ত্রী এবং পরিবার তাইতো ভেবেছিল। কিন্তু সৃষ্টিকর্তার প্রকৃতিবিধান কি অন্যকিছু রেখেছিল তাদের জন্য?</p>

	<p>ক্রনিক কোনো ব্যাধি কিমবা অন্য কোন জন্মগত / জেনেটিক রোগ যার ছিলনা, সেই সুস্থসবল তমাল গতবছর (২০২৪) কক্সবাজার বেড়াতে যেয়ে হঠাৎ ঘাড়ে ব্যথা এবং হাঁটারচলার অসুবিধা অনুভব করে। বেশ কিছু পরীক্ষা-নিরীক্ষা করে ধরা পড়ে তমালের স্পাইন এ দুটি টিউমার, লিভারে টিউমার। এরপর অসুস্থতা বাড়তে থাকে এবং অতিরিক্ত রক্তক্ষরণে শরীর দুর্বল হতে থাকে, দেখা দেয় ফুসফুসের জটিলতা, একাধিক টেস্টের পর শেষে জানা গেল তমাল Multiple Myeloma (DSS-IIIB) তে আক্রান্ত, সহজে আমরা যেটাকে ব্লাড ক্যান্সার নামে চিনি। ডক্টর জানালেন তমালের ক্যান্সার শেষ স্টেজ এ আছে। High Risk Variant (Del 17p, Del 13q, Monosomy 1)</p>

	<p>সদ্য বিবাহিত দম্পতির স্বাভাবিক জীবনযাত্রায় আগমণ ঘটে ব্লাড ক্যান্সার নামক বিভীষিকার। প্রিয়জন হারানোর ভয় নেমে আসে পুরো পরিবারে, নেমে আসে সদ্য বিবাহিত মেয়েটির জীবনেও। প্রিয়জনের সাথে জীবনের সুখদুখঃ ভাগাভাগি করে নেবার পরিবর্তে তাদের সময় কাটছে তমালের কাছে, আইসিইউর বাইরে কোন অলিক সুসংবাদের প্রতীক্ষায়। অসহায়ত্ব গ্রাস করেছে তাদের সকলের জীবনের যাটুকু সুখের।</p>

	<p>২০২৪ থেকেই, শারীরিক ভাবে তমালের আর সাথে সাথে মানসিক ভাবে পুরো পরিবার এর যুদ্ধটাও শুরু হয়ে যায়। ক্যান্সার ধরা পড়বার শুরু থেকেই তাঁর পরিবার এই ব্যয়বহুল চিকিৎসা চালিয়ে আসছে। RVD প্রোটোকলে এন্টিমায়োলোমা কেমোথেরাপি এবং তার পরবর্তীতে ২০২৪ এর সেপ্টেম্বরে ঢাকার Evercare হাসপাতালে Autologous Bone Marrow Transplant করানো হয় তমালের। তদব্ধি চিকিৎসা ব্যয় প্রায় ৬০ লাখ টাকা।</p>

	<p>প্রায় ৯ মাস ফলো আপ এবং আল্লাহর রহমতে রোগ মুক্ত থাকার পর তমাল, তার পরিবার এবং শুভানুধ্যায়ী সকলেই ক্যান্সার জয়ের স্বপ্ন দেখতে থাকে। কিন্তু ২০২৫ এর মে মাসে ক্যান্সার আবার ফেরত আসে এবং Spine এ নতুন টিউমার ধরা পড়ে যেটা খুব দ্রুত বড় হয়ে নার্ভের উপর চাপ ফেলে যার ফোলে তমালের দুই পা অবশ হয়ে যায়। ক্যান্সারের এই ফীরে আসা এবং সেই শুরু থেকে সবকিছু শুরু করা একদিকে মানসিক অন্যদিকে শারীরিক ভাবেও আক্রান্ত ব্যক্তি ও তার পরিবারের জন্য অত্যন্ত কষ্টকর। তবুও বাঁচবার অসীম ইচ্ছে থেকে তমালের চিকিৎসা থামেনি। আমরা চাইনা শুধুমাত্র টাকার অভাবে তমালের চিকিৎসা থেমে যাক। তার পরিবার হারাক তাদের আপনজন, আমরা হারাই আমাদের বন্ধু, ছোটোভাই কিংবা বড়ভাইকে।</p>

	<p>বর্তমানে Monclonal Antibody Daratumumab সহ এন্টিমায়োলোমা ওষুধের পাশাপাশি Spine এ রেডিওথেরাপি দিয়ে টিউমারের আকার ছোট করার চেষ্টা চলছে। গত ২১ আগস্ট,২০২৫ বুকে ব্যাথা নিয়ে রোগীকে HDU তে ভর্তি করানো হয় এবং এখনো হাসপাতালে হেমাটোলজিস্ট প্রফেসর ডা. অখিল রঞ্জন বিশ্বাসের অধীনে রোগী চিকিৎসাধীন। চিকিৎসকরা যে প্লান দিয়েছেন সেটা আশাব্যঞ্জক হলেও এই লড়াই অতি দীর্ঘ এবং অত্যন্ত ব্যয়বহুল যাতে আনুমানিক আরও প্রায় ৭৫ লক্ষ টাকা ব্যয় করতে হবে এবং যা কিনা ক্ষেত্রবিশেষে আরও বেশি ব্যয়বহুল হতে পারে। এত বিশাল অংকের খরচ সামলাতে প্রয়োজন আমাদের সকলের এগিয়ে আসা একটি মানবিক দায়িত্ব।</p>

	<p>তমালকে যারা ব্যক্তিগতভাবে চিনেন তারা জানেন, এই সদা হাস্যজ্জ্বল এই মানুষটা কতটা হাসিমুখ এবং নির্মল ছিলেন। সবার সাথে মুখে এক গাল হাসি নিয়ে কথা বলতেন। সেই মানুষটার আজকের এই অবস্থা থেকে স্বাভাবিক অবস্থানে ফিরিয়ে আনার দায়িত্ব আমাদেরই। আমরা যদি মাগুরা, খুলনা বিশ্ববিদ্যালয়সহ সারা বাংলাদেশের মানুষ এক হই তাহলে তমালের হাসিমুখ আমরা আবার ফিরিয়ে আনতে পারব। তাঁর বাবা মায়ের কোলে ফিরিয়ে দিতে পারবো তাদের সন্তানকে, স্ত্রীর কাছে ফেরাতে পারবো ভালোবাসার কাছের মানুষকে, ছোটো ভাই ফিরে পাবে তার প্রাণের বড় ভাইকে। আমরা ফিরে পাবো আমাদের বন্ধু তমাল কে। তমালের এই লড়াই এক মানবিক লড়াই। আমদের দাবী একটি মানবিক দাবী। তমালের লড়াইয়ে আমরাও সামিল হই।</p>

	<p>আসুন তমালের পাশে দাঁড়াই, মানবতার পাশে দাঁড়াই।</p>',
	7500000,
	true,
	true,
	true,
	true,
	0,
	0,
	'a67dc254-7410-4394-8b53-eb148eab0477'
);
`

func InsertDemoData() {
	configPath := flag.String("config", "env/config.yaml", "config file")

	config := viper.NewWithOptions(
		viper.EnvKeyReplacer(
			strings.NewReplacer(".", "_"),
		),
	)
	config.SetConfigFile(*configPath)
	config.SetConfigType("yaml")
	config.AutomaticEnv()
	if err := config.ReadInConfig(); err != nil {
		log.Fatalf("Error loading configuration: %v", err)
	}

	db, err := Open(config)
	if err != nil {
		log.Fatalf("error opening db connection: %v", err)
	}
	defer func() { _ = db.Close() }()
	passByte, err := bcrypt.GenerateFromPassword([]byte(config.GetString("admin.password")), bcrypt.DefaultCost)
	if err != nil {
		log.Fatal(err)
	}
	_, err = db.Exec(insertFirstUser, config.GetString("admin.name"), config.GetString("admin.batch"), config.GetString("admin.email"), passByte)
	if err != nil {
		log.Fatalf("failed to insert user: %v", err)
	}
	_, err = db.Exec(insertFirstCurrency)
	if err != nil {
		log.Fatalf("failed to insert currency: %v", err)
	}
	_, err = db.Exec(insertSettings)
	if err != nil {
		log.Fatalf("failed to insert settings: %v", err)
	}
	defer db.Close()
}
